ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DA64def.inc
; EVSYS_CHANNEL8 masks
.equ EVSYS_CHANNEL8_gm = 0xFF            ; Channel 8 generator select group mask
.equ EVSYS_CHANNEL8_gp = 0               ; Channel 8 generator select group position
.equ EVSYS_CHANNEL8_0_bm = (1<<0)        ; Channel 8 generator select bit 0 mask
.equ EVSYS_CHANNEL8_0_bp = 0             ; Channel 8 generator select bit 0 position
.equ EVSYS_CHANNEL8_1_bm = (1<<1)        ; Channel 8 generator select bit 1 mask
.equ EVSYS_CHANNEL8_1_bp = 1             ; Channel 8 generator select bit 1 position
.equ EVSYS_CHANNEL8_2_bm = (1<<2)        ; Channel 8 generator select bit 2 mask
.equ EVSYS_CHANNEL8_2_bp = 2             ; Channel 8 generator select bit 2 position
.equ EVSYS_CHANNEL8_3_bm = (1<<3)        ; Channel 8 generator select bit 3 mask
.equ EVSYS_CHANNEL8_3_bp = 3             ; Channel 8 generator select bit 3 position
.equ EVSYS_CHANNEL8_4_bm = (1<<4)        ; Channel 8 generator select bit 4 mask
.equ EVSYS_CHANNEL8_4_bp = 4             ; Channel 8 generator select bit 4 position
.equ EVSYS_CHANNEL8_5_bm = (1<<5)        ; Channel 8 generator select bit 5 mask
.equ EVSYS_CHANNEL8_5_bp = 5             ; Channel 8 generator select bit 5 position
.equ EVSYS_CHANNEL8_6_bm = (1<<6)        ; Channel 8 generator select bit 6 mask
.equ EVSYS_CHANNEL8_6_bp = 6             ; Channel 8 generator select bit 6 position
.equ EVSYS_CHANNEL8_7_bm = (1<<7)        ; Channel 8 generator select bit 7 mask
.equ EVSYS_CHANNEL8_7_bp = 7             ; Channel 8 generator select bit 7 position

; EVSYS_CHANNEL9 masks
.equ EVSYS_CHANNEL9_gm = 0xFF            ; Channel 9 generator select group mask
.equ EVSYS_CHANNEL9_gp = 0               ; Channel 9 generator select group position
.equ EVSYS_CHANNEL9_0_bm = (1<<0)        ; Channel 9 generator select bit 0 mask
.equ EVSYS_CHANNEL9_0_bp = 0             ; Channel 9 generator select bit 0 position
.equ EVSYS_CHANNEL9_1_bm = (1<<1)        ; Channel 9 generator select bit 1 mask
.equ EVSYS_CHANNEL9_1_bp = 1             ; Channel 9 generator select bit 1 position
.equ EVSYS_CHANNEL9_2_bm = (1<<2)        ; Channel 9 generator select bit 2 mask
.equ EVSYS_CHANNEL9_2_bp = 2             ; Channel 9 generator select bit 2 position
.equ EVSYS_CHANNEL9_3_bm = (1<<3)        ; Channel 9 generator select bit 3 mask
.equ EVSYS_CHANNEL9_3_bp = 3             ; Channel 9 generator select bit 3 position
.equ EVSYS_CHANNEL9_4_bm = (1<<4)        ; Channel 9 generator select bit 4 mask
.equ EVSYS_CHANNEL9_4_bp = 4             ; Channel 9 generator select bit 4 position
.equ EVSYS_CHANNEL9_5_bm = (1<<5)        ; Channel 9 generator select bit 5 mask
.equ EVSYS_CHANNEL9_5_bp = 5             ; Channel 9 generator select bit 5 position
.equ EVSYS_CHANNEL9_6_bm = (1<<6)        ; Channel 9 generator select bit 6 mask
.equ EVSYS_CHANNEL9_6_bp = 6             ; Channel 9 generator select bit 6 position
.equ EVSYS_CHANNEL9_7_bm = (1<<7)        ; Channel 9 generator select bit 7 mask
.equ EVSYS_CHANNEL9_7_bp = 7             ; Channel 9 generator select bit 7 position

; EVSYS_USERCCLLUT0A masks
.equ EVSYS_USER_gm = 0xFF                ; User channel select group mask
.equ EVSYS_USER_gp = 0                   ; User channel select group position
.equ EVSYS_USER_0_bm = (1<<0)            ; User channel select bit 0 mask
.equ EVSYS_USER_0_bp = 0                 ; User channel select bit 0 position
.equ EVSYS_USER_1_bm = (1<<1)            ; User channel select bit 1 mask
.equ EVSYS_USER_1_bp = 1                 ; User channel select bit 1 position
.equ EVSYS_USER_2_bm = (1<<2)            ; User channel select bit 2 mask
.equ EVSYS_USER_2_bp = 2                 ; User channel select bit 2 position
.equ EVSYS_USER_3_bm = (1<<3)            ; User channel select bit 3 mask
.equ EVSYS_USER_3_bp = 3                 ; User channel select bit 3 position
.equ EVSYS_USER_4_bm = (1<<4)            ; User channel select bit 4 mask
.equ EVSYS_USER_4_bp = 4                 ; User channel select bit 4 position
.equ EVSYS_USER_5_bm = (1<<5)            ; User channel select bit 5 mask
.equ EVSYS_USER_5_bp = 5                 ; User channel select bit 5 position
.equ EVSYS_USER_6_bm = (1<<6)            ; User channel select bit 6 mask
.equ EVSYS_USER_6_bp = 6                 ; User channel select bit 6 position
.equ EVSYS_USER_7_bm = (1<<7)            ; User channel select bit 7 mask
.equ EVSYS_USER_7_bp = 7                 ; User channel select bit 7 position

; EVSYS_USERCCLLUT0B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT2A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT2B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT4A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT4B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT5A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT5B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERADC0START masks
; Masks for EVSYS_USER already defined

; EVSYS_USERPTCSTART masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTB masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTC masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTD masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTE masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTF masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTG masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART0IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART1IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART2IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART3IRDA masks
; Masks for EVSYS_USER already defined

