ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DA64def.inc
; PORTMUX_ACROUTEA masks
.equ PORTMUX_AC0_bm = 0x01               ; Analog Comparator 0 Output bit mask
.equ PORTMUX_AC0_bp = 0                  ; Analog Comparator 0 Output bit position
.equ PORTMUX_AC1_bm = 0x02               ; Analog Comparator 1 Output bit mask
.equ PORTMUX_AC1_bp = 1                  ; Analog Comparator 1 Output bit position
.equ PORTMUX_AC2_bm = 0x04               ; Analog Comparator 2 Output bit mask
.equ PORTMUX_AC2_bp = 2                  ; Analog Comparator 2 Output bit position

; PORTMUX_ZCDROUTEA masks
.equ PORTMUX_ZCD0_bm = 0x01              ; Zero Cross Detector 0 Output bit mask
.equ PORTMUX_ZCD0_bp = 0                 ; Zero Cross Detector 0 Output bit position
.equ PORTMUX_ZCD1_bm = 0x02              ; Zero Cross Detector 1 Output bit mask
.equ PORTMUX_ZCD1_bp = 1                 ; Zero Cross Detector 1 Output bit position
.equ PORTMUX_ZCD2_bm = 0x04              ; Zero Cross Detector 2 Output bit mask
.equ PORTMUX_ZCD2_bp = 2                 ; Zero Cross Detector 2 Output bit position

; Analog Comparator 0 Output select
.equ PORTMUX_AC0_DEFAULT_gc = (0x00<<0)  ; OUT on PA7
.equ PORTMUX_AC0_ALT1_gc = (0x01<<0)     ; OUT on PC6

; Analog Comparator 1 Output select
.equ PORTMUX_AC1_DEFAULT_gc = (0x00<<1)  ; OUT on PA7
.equ PORTMUX_AC1_ALT1_gc = (0x01<<1)     ; OUT on PC6

; Analog Comparator 2 Output select
.equ PORTMUX_AC2_DEFAULT_gc = (0x00<<2)  ; OUT on PA7
.equ PORTMUX_AC2_ALT1_gc = (0x01<<2)     ; OUT on PC6

; CCL Look-Up Table 0 Signals select
.equ PORTMUX_LUT0_DEFAULT_gc = (0x00<<0) ; Out: PA3 In: PA0, PA1, PA2
.equ PORTMUX_LUT0_ALT1_gc = (0x01<<0)    ; Out: PA6 In: PA0, PA1, PA2

; CCL Look-Up Table 1 Signals select
.equ PORTMUX_LUT1_DEFAULT_gc = (0x00<<1) ; Out: PC3 In: PC0, PC1, PC2
.equ PORTMUX_LUT1_ALT1_gc = (0x01<<1)    ; Out: PC6 In: PC0, PC1, PC2

; CCL Look-Up Table 2 Signals select
.equ PORTMUX_LUT2_DEFAULT_gc = (0x00<<2) ; Out: PD3 In: PD0, PD1, PD2
.equ PORTMUX_LUT2_ALT1_gc = (0x01<<2)    ; Out: PD6 In: PD0, PD1, PD2

; CCL Look-Up Table 3 Signals select
.equ PORTMUX_LUT3_DEFAULT_gc = (0x00<<3) ; Out: PF3 In: PF0, PF1, PF2

; CCL Look-Up Table 4 Signals select
.equ PORTMUX_LUT4_DEFAULT_gc = (0x00<<4) ; Out: PB3 In: PB0, PB1, PB2
.equ PORTMUX_LUT4_ALT1_gc = (0x01<<4)    ; Out: PB6 In: PB0, PB1, PB2

; CCL Look-Up Table 5 Signals select
.equ PORTMUX_LUT5_DEFAULT_gc = (0x00<<5) ; Out: PG3 In: PG0, PG1, PG2
.equ PORTMUX_LUT5_ALT1_gc = (0x01<<5)    ; Out: PG6 In: PG0, PG1, PG2

; Event Output A select
.equ PORTMUX_EVOUTA_DEFAULT_gc = (0x00<<0) ; EVOUT on PA2
.equ PORTMUX_EVOUTA_ALT1_gc = (0x01<<0)  ; EVOUT on PA7

; Event Output B select
.equ PORTMUX_EVOUTB_DEFAULT_gc = (0x00<<1) ; EVOUT on PB2
.equ PORTMUX_EVOUTB_ALT1_gc = (0x01<<1)  ; EVOUT on PB7

; Event Output C select
.equ PORTMUX_EVOUTC_DEFAULT_gc = (0x00<<2) ; EVOUT on PC2
.equ PORTMUX_EVOUTC_ALT1_gc = (0x01<<2)  ; EVOUT on PC7

; Event Output D select
.equ PORTMUX_EVOUTD_DEFAULT_gc = (0x00<<3) ; EVOUT on PD2
.equ PORTMUX_EVOUTD_ALT1_gc = (0x01<<3)  ; EVOUT on PD7

; Event Output E select
.equ PORTMUX_EVOUTE_DEFAULT_gc = (0x00<<4) ; EVOUT on PE2
.equ PORTMUX_EVOUTE_ALT1_gc = (0x01<<4)  ; EVOUT on PE7

; Event Output F select
.equ PORTMUX_EVOUTF_DEFAULT_gc = (0x00<<5) ; EVOUT on PF2

; Event Output G select
.equ PORTMUX_EVOUTG_DEFAULT_gc = (0x00<<6) ; EVOUT on PG2
.equ PORTMUX_EVOUTG_ALT1_gc = (0x01<<6)  ; EVOUT on PG7

; SPI0 Signals select
.equ PORTMUX_SPI0_DEFAULT_gc = (0x00<<0) ; PA4, PA5, PA6, PA7
.equ PORTMUX_SPI0_ALT1_gc = (0x01<<0)    ; PE0, PE1, PE2, PE3
.equ PORTMUX_SPI0_ALT2_gc = (0x02<<0)    ; PG4, PG5, PG6, PG7
.equ PORTMUX_SPI0_NONE_gc = (0x03<<0)    ; Not connected to any pins

; SPI1 Signals select
.equ PORTMUX_SPI1_DEFAULT_gc = (0x00<<2) ; PC0, PC1, PC2, PC3
.equ PORTMUX_SPI1_ALT1_gc = (0x01<<2)    ; PC4, PC5, PC6, PC7
.equ PORTMUX_SPI1_ALT2_gc = (0x02<<2)    ; PB4, PB5, PB6, PB7
.equ PORTMUX_SPI1_NONE_gc = (0x03<<2)    ; Not connected to any pins

; TCA0 Signals select
.equ PORTMUX_TCA0_PORTA_gc = (0x00<<0)   ; PA0, PA1, PA2, PA3, PA4, PA5
.equ PORTMUX_TCA0_PORTB_gc = (0x01<<0)   ; PB0, PB1, PB2, PB3, PB4, PB5
.equ PORTMUX_TCA0_PORTC_gc = (0x02<<0)   ; PC0, PC1, PC2, PC3, PC4, PC5
.equ PORTMUX_TCA0_PORTD_gc = (0x03<<0)   ; PD0, PD1, PD2, PD3, PD4, PD5
.equ PORTMUX_TCA0_PORTE_gc = (0x04<<0)   ; PE0, PE1, PE2, PE3, PE4, PE5
.equ PORTMUX_TCA0_PORTF_gc = (0x05<<0)   ; PF0, PF1, PF2, PF3, PF4, PF5
.equ PORTMUX_TCA0_PORTG_gc = (0x06<<0)   ; PG0, PG1, PG2, PG3, PG4, PG5

; TCA1 Signals select
.equ PORTMUX_TCA1_PORTB_gc = (0x00<<3)   ; PB0, PB1, PB2, PB3, PB4, PB5
.equ PORTMUX_TCA1_PORTC_gc = (0x01<<3)   ; PC4, PC5, PC6
.equ PORTMUX_TCA1_PORTE_gc = (0x02<<3)   ; PE4, PE5, PE6
.equ PORTMUX_TCA1_PORTG_gc = (0x03<<3)   ; PG0, PG1, PG2, PG3, PG4, PG5

; TCB0 Output select
.equ PORTMUX_TCB0_DEFAULT_gc = (0x00<<0) ; WO on PA2
.equ PORTMUX_TCB0_ALT1_gc = (0x01<<0)    ; WO on PF4

; TCB1 Output select
.equ PORTMUX_TCB1_DEFAULT_gc = (0x00<<1) ; WO on PA3
.equ PORTMUX_TCB1_ALT1_gc = (0x01<<1)    ; WO on PF5

; TCB2 Output select
.equ PORTMUX_TCB2_DEFAULT_gc = (0x00<<2) ; WO on PC0
.equ PORTMUX_TCB2_ALT1_gc = (0x01<<2)    ; WO on PB4

; TCB3 Output select
.equ PORTMUX_TCB3_DEFAULT_gc = (0x00<<3) ; WO on PB5
.equ PORTMUX_TCB3_ALT1_gc = (0x01<<3)    ; WO on PC1

; TCB4 Output select
.equ PORTMUX_TCB4_DEFAULT_gc = (0x00<<4) ; WO on PG3
.equ PORTMUX_TCB4_ALT1_gc = (0x01<<4)    ; WO on PC6

; TCD0 Signals select
.equ PORTMUX_TCD0_DEFAULT_gc = (0x00<<0) ; PA4, PA5, PA6, PA7
.equ PORTMUX_TCD0_ALT1_gc = (0x01<<0)    ; PB4, PB5, PB6, PB7
.equ PORTMUX_TCD0_ALT2_gc = (0x02<<0)    ; PF0, PF1, PF2, PF3
.equ PORTMUX_TCD0_ALT3_gc = (0x03<<0)    ; PG4, PG5, PG6, PG7

; TWI0 Signals select
.equ PORTMUX_TWI0_DEFAULT_gc = (0x00<<0) ; PA2, PA3, PC2, PC3
.equ PORTMUX_TWI0_ALT1_gc = (0x01<<0)    ; PA2, PA3, PC6, PC7
.equ PORTMUX_TWI0_ALT2_gc = (0x02<<0)    ; PC2, PC3, PC6, PC7

; TWI1 Signals select
.equ PORTMUX_TWI1_DEFAULT_gc = (0x00<<2) ; PF2, PF3, PB2, PB3
.equ PORTMUX_TWI1_ALT1_gc = (0x01<<2)    ; PF2, PF3, PB6, PB7
.equ PORTMUX_TWI1_ALT2_gc = (0x02<<2)    ; PB2, PB3, PB6, PB7

; USART0 Signals select
.equ PORTMUX_USART0_DEFAULT_gc = (0x00<<0) ; PA0, PA1, PA2, PA3
.equ PORTMUX_USART0_ALT1_gc = (0x01<<0)  ; PA4, PA5, PA6, PA7
.equ PORTMUX_USART0_NONE_gc = (0x03<<0)  ; Not connected to any pins

; USART1 Signals select
.equ PORTMUX_USART1_DEFAULT_gc = (0x00<<2) ; PC0, PC1, PC2, PC3
.equ PORTMUX_USART1_ALT1_gc = (0x01<<2)  ; PC4, PC5, PC6, PC7
.equ PORTMUX_USART1_NONE_gc = (0x03<<2)  ; Not connected to any pins

; USART2 Signals select
.equ PORTMUX_USART2_DEFAULT_gc = (0x00<<4) ; PF0, PF1, PF2, PF3
.equ PORTMUX_USART2_ALT1_gc = (0x01<<4)  ; PF4, PF5
.equ PORTMUX_USART2_NONE_gc = (0x03<<4)  ; Not connected to any pins

; USART3  Signals select
.equ PORTMUX_USART3_DEFAULT_gc = (0x00<<6) ; PB0, PB1, PB2, PB3
.equ PORTMUX_USART3_ALT1_gc = (0x01<<6)  ; PB4, PB5, PB6, PB7
.equ PORTMUX_USART3_NONE_gc = (0x03<<6)  ; Not connected to any pins

; USART4 Signals select
.equ PORTMUX_USART4_DEFAULT_gc = (0x00<<0) ; PE0, PE1, PE2, PE3
.equ PORTMUX_USART4_ALT1_gc = (0x01<<0)  ; PE4, PE5, PE6, PE7
.equ PORTMUX_USART4_NONE_gc = (0x03<<0)  ; Not connected to any pins

